ruby-api/app/controllers/api/v1/aggregate_events_controller.rb

SELECT aggregate_events.action_id, actions.action, actions.url, actions.element, user_events.user_agent, COUNT(aggregate_events.id) as rage_count FROM "aggregate_events" INNER JOIN "actions" ON "actions"."id" = "aggregate_events"."action_id" INNER JOIN "user_events" ON "user_events"."id" = "aggregate_events"."user_event_id" GROUP BY "aggregate_events"."action_id", "actions"."action", "actions"."url", "actions"."element", "user_events"."user_agent"
---
      def index
        grouped_events = AggregateEvent.joins(:action, :user_event)
                                      .group('aggregate_events.action_id', 'actions.action', 'actions.url', 'actions.element', 'user_events.user_agent')
                                      .select(
                                        'aggregate_events.action_id, actions.action, actions.url, actions.element, user_events.user_agent, COUNT(aggregate_events.id) as rage_count'
                                      ).order('rage_count DESC')

SELECT "aggregate_events".* FROM "aggregate_events" WHERE "aggregate_events"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
UPDATE "aggregate_events" SET "screenshot" = $1, "updated_at" = $2 WHERE "aggregate_events"."id" = $3  [["screenshot", "<42594 bytes of binary data>"], ["updated_at", "2024-12-21 07:04:47.512374"], ["id", 24]]
---
      def update_all
        params[:ids].each do |id|
          AggregateEvent.find(id).update(update_params)

SELECT "actions".* FROM "actions" WHERE "actions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "aggregate_events".* FROM "aggregate_events" WHERE "aggregate_events"."action_id" = $1  [["action_id", 3]]
SELECT "user_events".* FROM "user_events" WHERE "user_events"."id" IN ($1, $2)  [["id", 102], ["id", 104]]
---
      def show
        action = Action.find(params[:id])
        user_events = action.aggregate_events.includes(:user_event).map do |ae|