ruby-api/app/controllers/api/v1/user_events_controller.rb

INSERT INTO "user_events" ("captured_at", "user_agent", "uid", "action_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
      def create
        events_data = create_params # Assuming the JSON body contains "clicks" key as shown in the example
        service = EventsService::Create.new(events_data).call

        if service.present?
          render json: { data: service, message: I18n.t('user_events.success.create') }, status: :created