ruby-api/app/services/events_service/create.rb

    def call
      ActiveRecord::Base.transaction do
        rage_event_ids = []
        @events_params.each do |event_param|
          action = find_action(event_param)

          user_event_params = build_user_event_params(event_param, action)
          user_event = UserEvent.create!(user_event_params)
<<<<<<< Updated upstream

          res = action&.user_events&.where(uid: event_param[:uid], captured_at: 5.seconds.ago..user_event.captured_at.to_datetime.utc)
          if res && res.count == 5
            rage_click_event = create_aggregate_event(user_event, action)
            rage_event_ids << rage_click_event.id
          end
=======
          @user_events = []
          @user_events << user_event
          # if action.user_events.where(uid: event_param[:uid], captured_at: 5.seconds.ago..DateTime.current).count == 5
          #   rage_click_event = create_aggregate_event(user_event, action)
          #   rage_event_ids << rage_click_event.id
          # end
>>>>>>> Stashed changes
        end
        rage_click = RageClickService::Detector.new().analyze_clicks(@user_events)
        AggregateEvent.create!(aggregate_event_params(rage_click))
---
INSERT INTO "user_events" ("captured_at", "user_agent", "uid", "action_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT COUNT(*) FROM "user_events" WHERE "user_events"."action_id" = $1 AND "user_events"."uid" = $2 AND "user_events"."captured_at" BETWEEN $3 AND $4  [["action_id", 12], ["uid", "a911f3df-556f-4b96-b716-aa74d1c86810"], ["captured_at", "2024-12-21 07:04:40.648035"], ["captured_at", "2024-12-21 07:04:44.420000"]]
INSERT INTO "aggregate_events" ("uid", "screenshot", "action_id", "user_event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def find_action(param)
      Action.find_or_create_by(url: param[:url], element: param[:element_id], action: param[:action])
---
SELECT "actions".* FROM "actions" WHERE "actions"."url" = $1 AND "actions"."element" = $2 AND "actions"."action" = $3 LIMIT $4  [["url", "http://localhost:5174/"], ["element", "Toggle Side Panel"], ["action", "click"], ["LIMIT", 1]]

    def create_aggregate_event(user_event, action)
      AggregateEvent.find_or_create_by!(
        user_event_id: user_event.id,
        action_id: action.id,
        uid: user_event.uid
      )
---
SELECT "aggregate_events".* FROM "aggregate_events" WHERE "aggregate_events"."user_event_id" = $1 AND "aggregate_events"."action_id" = $2 AND "aggregate_events"."uid" = $3 LIMIT $4  [["user_event_id", 1193], ["action_id", 13], ["uid", "a911f3df-556f-4b96-b716-aa74d1c86810"], ["LIMIT", 1]]